In [1]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [2]:
import pymysql

In [3]:
# MySQL Connection

conn = pymysql.connect(host="127.0.0.1", user="root", passwd='qwer1234', db="education", charset="utf8")

In [4]:
curs = conn.cursor()

In [5]:
sql = "select * from student"
curs.execute(sql)

10

In [6]:
# Data Fetch
rows = curs.fetchall()
print(rows)

(('dsf', 'sdf', 'sdf', 'sdf', None), ('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None), ('S111', '홍길동', '컴퓨터정보과', '123', None), ('S112', '그만', '하고', '싶다', None), ('ㄱㅅ', 'ㅇㅎ', '로', 'ㅈㄱ셔', None))

In [7]:
# list로 변환

rowList = list(rows)
print(rowList)

[('dsf', 'sdf', 'sdf', 'sdf', None), ('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None), ('S111', '홍길동', '컴퓨터정보과', '123', None), ('S112', '그만', '하고', '싶다', None), ('ㄱㅅ', 'ㅇㅎ', '로', 'ㅈㄱ셔', None)]

In [8]:
print(rowList[0])

('dsf', 'sdf', 'sdf', 'sdf', None)

In [9]:
conn.close()

# select의 내용을 dataframe으로 보기

In [10]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\ham\anaconda3\lib\site-packages (1.4.7)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ham\anaconda3\lib\site-packages (from sqlalchemy) (1.0.0)

In [11]:
import pandas as pd
from sqlalchemy import create_engine

In [12]:
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1:3306/education?", convert_unicode=True)
conn = engine.connect()

In [13]:
data = pd.read_sql_table('student', conn)
data

  scode sname   sdept    sphone saddress
0   dsf   sdf     sdf       sdf     None
1  S001   박소명  컴퓨터공학과  123-4567     None
2  S002   최민국  컴퓨터공학과  234-5678     None
3  S003   이승호    국문학과  345-6789     None
4  S004   정수봉    국문학과  456-7890     None
5  S005   김상진     사학과  567-8901     None
6  S006   황정숙     사학과  678-9012     None
7  S111   홍길동  컴퓨터정보과       123     None
8  S112    그만      하고        싶다     None
9    ㄱㅅ    ㅇㅎ       로       ㅈㄱ셔     None

# dataFrame을 Database로 insert 하기

In [15]:
column = ['rank', 'movie']
movies = pd.read_csv("./Data/DaumList.csv")
movies.columns = column
movies.head()

   rank        movie
0     1       블랙 위도우
1     2         발신제한
2     3         크루엘라
3     4  콰이어트 플레이스 2
4     5           랑종

In [17]:
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1:3306/daum?", convert_unicode=True)
conn = engine.connect()

In [18]:
movies.to_sql(name='movielist', con=engine, if_exists='append', index=False)